Revit 2027 API
BuiltInFailures.GroupFailures.NoDetailGroups Property
 There are no Detail Groups in this Project or Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoDetailGroups { get; }
Public Shared ReadOnly Property NoDetailGroups As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoDetailGroups {
	FailureDefinitionId^ get ();
}
static member NoDetailGroups : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace